{
    "residential_facilities": [
        "OVER VIEW",
        "St. Joseph’s College of Engineering and Technology provides hostel facilities for the students within the campus itself. The hostels are set in lush green surroundings with clean air, water and a calm atmosphere conducive for learning and for the physical wellbeing of the students. The catholic priests of the diocese of Palai and Rev. sisters from the SABS congregation are the wardens of our hostels. There are four hostels – St. Thomas (for boys), St. Augustine’s (for girls), St. Mary’s (for boys) & St. Alphonsa Hostel (for boys). A total number of 1400 students can be accommodated at the college hostels. To cater to the academic needs of the students, resident tutors are available in the hostel. Our hostels aim at the wholistic development – intellectual, cultural, moral, Social, emotional and spiritual – of the students. The hostels provide a disciplined, safe, calm, hygienic and peaceful atmosphere for students for their studies and for their personal growth. The hostel mess provides good and wholesome food. Centralized and mechanized kitchen located at St. Thomas hostel is the food factory of all SJCET hostels. Hostels follow dividing system in running the hostel mess. There is a mess committee with hostel wardens and student representatives. The mess executive committee regularly (once in a month) meets and decide the food menu. For the entertainment of the students, a lobby with television has been arranged and major newspapers are also provided. There is a chapel for ensuring the spiritual growth with holy mass and evening prayer every day . Moral talks are also held regularly and counselling facilities are also available. Students are encouraged to make use of the college library and for this purpose hostel timing have been chalked out. The students are expected to strictly follow the hostel rules and guidelines regarding general discipline, behavior, study hours, meal timings etc. They are also expected to take good care of hostel properties like furniture, room, toilet and bath-room fittings, electrical accessories, etc. Hostel day is celebrated in each hostel.",
        "Facilities",
        "The hostel is well equipped with high quality infrastructure such as:",
        "Spacious dining halls",
        "Spacious dining halls",
        "Chapels",
        "Chapels",
        "Study halls",
        "Study halls",
        "Gymnasiums",
        "Gymnasiums",
        "Wi-Fi facilities",
        "Wi-Fi facilities",
        "24*7 Electricity.",
        "24*7 Electricity.",
        "Hot/Cold purified drinking water facility",
        "Hot/Cold purified drinking water facility",
        "Clean toilets and bathrooms",
        "Clean toilets and bathrooms",
        "Laundry and drying area",
        "Laundry and drying area",
        "All these facilities make our hostels a home away from home, ensuring a safe and positive environment for the students.",
        "Fee Structure 2024-2025",
        "St.Thomas Hostel (Boys)",
        "St. Thomas Hostel for boys was built  in 2003. It has a capacity of 308 beds for students. The hostel consists of blocks I & II. The hostel accommodates the third and fourth year B.Tech., MCA, MBA and M.Tech. students. The centralized kitchen of the college is located at this hostel. There are two wardens, resident tutors and hostel staff to look after the everyday affairs of the students.",
        "Wardens",
        "Wardens",
        "Capacity",
        "Capacity",
        "Wardens",
        "Wardens",
        "Warden: Rev. Dr. Joseph Purayidathil, MM, Ph.D.   Mob: 9446762362\nAssistant Warden: Rev. Fr. Kuriakose Vattamukalel, MA  Mob: 9447513597\nMess Manager: Rev. Fr. Joseph Vattappillil, LTh,LOCL Mob: 9497028498\nHostel Mobile. No. 9562239327",
        "Capacity",
        "Capacity",
        "Block 1: 58 rooms, 174 students\nBlock 2: 67 Rooms, 134 Students\nFaculty rooms: 2",
        "St. Alphonsa Hostel (Boys)",
        "St. Alphonsa Hostel came into existence in 2012. The hostel has a capacity of 423 beds for students. The hostel consists of Block I and II. The hostel accommodates first and second year B.Tech. students. The students of St. Joseph’s Institute of Hotel management and catering technology are also accommodated here. The students can make use the adjacent open stadium for playing football and cricket. Keeping in mind SJCET’s passion for quality and excellence, all facilities are provided for the well-being  of the students. There are three wardens, resident tutors and hostel staff to cater the needs of the students.",
        "Wardens",
        "Wardens",
        "Capacity",
        "Capacity",
        "Wardens",
        "Wardens",
        "Warden: Rev. Fr. Thomas Karottukizhakkel, MA, B.Ed. , Mob: 9447940444\nAssistant Warden: Rev. Fr. John Mattamundayil, M.Sc (Coun. Psy.),  Mob: 9446982681",
        "Hostel Mobile No : 8075620192",
        "Capacity",
        "Capacity",
        "Block 1: 69 rooms, 207 students\nBlock 2: 72 Rooms, 216 Students\nFaculty rooms: 10",
        "St. Mary’s Hostel (Boys)",
        "This hostel was established in the year 2003. The hostel has a capacity of 221 beds for students. First year B.Tech. & Integrated MCA students are accommodated at this hostel. A separate section in the hostel with 10 double rooms are available for staff members of the college. There are two wardens, resident tutors and hostel staff to support the students.",
        "Wardens",
        "Wardens",
        "Capacity",
        "Capacity",
        "Wardens",
        "Wardens",
        "Warden : Rev. Fr. Jeethu Mathew, MCA, Pursing PhD Mob:8075573679\nAsst. Warden :Rev. Fr. Cherian Moolayil, M.Sc Mob: 8606701030",
        "Hostel Ph. No: 8848516998",
        "Capacity",
        "Capacity",
        "Total Rooms: 67\nTotal  students: 201\nFaculty rooms: 10\nGuest rooms: 1",
        "St. Augustine Hostel (Girls)",
        "This hostel has a capacity of 351 beds. The hostel consists of 3 Blocks, Block A , Block B & Block C.  The hostel accommodates B.Tech, MCA, MBA and M.Tech. students. A separate wing of Block B in the hostel with 10 double rooms are available for the ladies staff members of the college. There are five wardens, resident tutors and hostel staff to look after the needs of the students.",
        "Wardens",
        "Wardens",
        "Capacity",
        "Capacity",
        "Wardens",
        "Wardens",
        "Warden: Sr. Tessy Kuttiyanickal, BA, B. Ed.,  Mob- 9148655264",
        "Asst. Wardens :",
        "Sr. Seena Vadakkedath, BA, B.Ed., Mob: 6238269171\nSr. Tessy Vanchipurackal Mob: 9447935007\nSr. Monica Kureethadam.,  Mob. 8330071750\nSr. Deepthy Padinjarevattappally, B. Com., TTC Mob: 8281510620, 7034863362",
        "Hostel Mobile No: 8848076766",
        "Capacity",
        "Capacity",
        "Block A: 47 rooms, 141 students\nBlock B: 50 rooms, 150 students\nBlock C: 20 rooms, 60 students",
        "Faculty Rooms: 10"
    ]
}